_posts/inbox/2019-03-05-inbox.html
---
layout: post
title: "收集箱"
date: 2019-03-05
categories: InBox
tags:
- InBox
---

<p>
日常收集和备忘，以待整理归档。
</p>

<div id="outline-container-org6285f1e" class="outline-2">
<h2 id="org6285f1e"><span class="section-number-2">1</span> 软件工具</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga6bad61" class="outline-3">
<h3 id="orga6bad61"><span class="section-number-3">1.1</span> 文本编辑</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org3029038" class="outline-4">
<h4 id="org3029038"><span class="section-number-4">1.1.1</span> Spacemacs 安装以及基本配置</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">
<pre class="src src-sh">brew install ag
brew install grep
brew tap d12frosted/emacs-plus
brew install emacs-plus
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#23433;&#35013;&#23436;&#27605;&#20043;&#21518;&#65292;&#38142;&#25509;&#25105;&#30340; spacemacs &#37197;&#32622;</span>
$<span style="color: #7590db;">XCFG</span>/editor/emacs/spacemacs/linkspac.sh
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#36755;&#20837; emacs &#36827;&#34892;&#21021;&#22987;&#21270;&#65292;&#22914;&#26524;&#20320;&#21487;&#20197;&#27491;&#24120;&#35775;&#38382; Github &#30340;&#35805;&#26102;&#38388;&#22312;&#21322;&#23567;&#26102;&#20043;&#20869;&#12290;</span>
emacs
</pre>
</div>
</div>
</div>

<div id="outline-container-org26b0024" class="outline-4">
<h4 id="org26b0024"><span class="section-number-4">1.1.2</span> 删除空行</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">
<pre class="src src-text">M-x flush-lines RET ^\s-*$ RET
</pre>
</div>
</div>
</div>

<div id="outline-container-org936ffb0" class="outline-4">
<h4 id="org936ffb0"><span class="section-number-4">1.1.3</span> Pandoc 安装以及基本配置</h4>
<div class="outline-text-4" id="text-1-1-3">
<div class="org-src-container">
<pre class="src src-sh">brew install pandoc
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#20998;&#26512;&#22120;&#23433;&#35013;</span>
brew install pandoc-citeproc
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#32452;&#20214;&#23433;&#35013;</span>
brew install librsvg homebrew/cask/basictex
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">&#22914;&#26524;&#35686;&#21578;&#32570;&#23569;&#23383;&#20307;</span>
tlmgr install collection-fontsrecommended
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8aecd05" class="outline-3">
<h3 id="org8aecd05"><span class="section-number-3">1.2</span> 多媒体</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org8b9a666" class="outline-4">
<h4 id="org8b9a666"><span class="section-number-4">1.2.1</span> 安装视频播放器</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<div id="outline-container-orgd0d4c78" class="outline-5">
<h5 id="orgd0d4c78"><span class="section-number-5">1.2.1.1</span> iina</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<div class="org-src-container">
<pre class="src src-sh">brew cask install iina
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6d857a2" class="outline-3">
<h3 id="org6d857a2"><span class="section-number-3">1.3</span> Terminal</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgdb4c40a" class="outline-4">
<h4 id="orgdb4c40a"><span class="section-number-4">1.3.1</span> locate</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">mac &#19979;&#26356;&#26032;&#25968;&#25454;&#24211;&#21629;&#20196;&#26159;</span>
sudo /usr/libexec/locate.updatedb
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">mac &#19979;&#20351;&#29992;&#19981;&#35201;&#20351;&#29992;&#36890;&#37197;&#31526;&#65292;locate &#33258;&#21160;&#23558;&#21253;&#21547;&#20851;&#38190;&#23383;&#30340;&#25991;&#20214;&#37117;&#26816;&#32034;</span>
locate temp
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4b1baa" class="outline-4">
<h4 id="orgc4b1baa"><span class="section-number-4">1.3.2</span> lszrz</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>不论是发送还是接收，，都是在服务器端输入命令执行的。</li>
<li>无法传输大于 4G 的文件。</li>
<li>使用 tmux 或其他多路终端屏幕可能会失败，尝试在服务器上增加 -e 选项以强制在传输过程中转义更多字符。</li>
<li>使用 expect 或 rlogin 可能会失败，因为它期望双方之间的大多数干净的 8 位连接。</li>
</ul>

<p>
&#x2013;注：本人在 mac + zsh + iterm2 环境里使用成功，但尝试在 tmux 环境中使用未成功！&#x2013;
</p>
</div>

<div id="outline-container-org5ffaf0a" class="outline-5">
<h5 id="org5ffaf0a"><span class="section-number-5">1.3.2.1</span> 安装 lrzsz</h5>
<div class="outline-text-5" id="text-1-3-2-1">
<div class="org-src-container">
<pre class="src src-sh">brew install lrzsz
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbe0a2c3" class="outline-5">
<h5 id="orgbe0a2c3"><span class="section-number-5">1.3.2.2</span> 下载 iTerm2 支持脚本</h5>
<div class="outline-text-5" id="text-1-3-2-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #4f97d7;">cd</span> /usr/local/bin
sudo curl -O https://raw.githubusercontent.com/mmastrac/iterm2-zmodem/master/iterm2-recv-zmodem.sh
sudo curl -O https://raw.githubusercontent.com/mmastrac/iterm2-zmodem/master/iterm2-send-zmodem.sh
sudo chmod +x iterm2-
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfadf73" class="outline-5">
<h5 id="orgcfadf73"><span class="section-number-5">1.3.2.3</span> 设置 iTerm2 Trigger</h5>
<div class="outline-text-5" id="text-1-3-2-3">
<p>
在 iTerm2 的 Preferences 中，选择 `Profiles—&gt;Default—&gt;Advanced—&gt;Triggers—&gt;Edit`，设置如下 trigger
</p>

<p>
#+end_srctext
Regular expression: rz waiting to receive.&#x00ad;&#x00ad;B0100
Action: Run Silent Coprocess
Parameters: /usr/local/bin/iterm2-send-zmodem.sh
Instant: checked
</p>

<p>
Regular expression: &#x00ad;&#x00ad;B00000000000000
Action: Run Silent Coprocess
Parameters: /usr/local/bin/iterm2-recv-zmodem.sh
Instant: checked
#+end_src
</p>
</div>
</div>

<div id="outline-container-org531b479" class="outline-5">
<h5 id="org531b479"><span class="section-number-5">1.3.2.4</span> 发送文件到远端服务器</h5>
<div class="outline-text-5" id="text-1-3-2-4">
<ul class="org-ul">
<li>在远端服务器执行 `rz`</li>
<li>本地选择文件传输</li>
<li>等待传输指示消失</li>
</ul>
</div>
</div>

<div id="outline-container-org7ba3749" class="outline-5">
<h5 id="org7ba3749"><span class="section-number-5">1.3.2.5</span> 接收远端服务器的文件</h5>
<div class="outline-text-5" id="text-1-3-2-5">
<ul class="org-ul">
<li>在远端服务器执行 `sz filename1 filename2 … filenameN`</li>
<li>本地选择目录保存</li>
<li>等待传输指示消失</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga6e5bf7" class="outline-2">
<h2 id="orga6e5bf7"><span class="section-number-2">2</span> 开发设计</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org7d5aeda" class="outline-3">
<h3 id="org7d5aeda"><span class="section-number-3">2.1</span> 关键字备忘</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org04cdb79" class="outline-4">
<h4 id="org04cdb79"><span class="section-number-4">2.1.1</span> 字面量</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
在计算机科学中，字面量（literal）是用于表达源代码中一个固定值的表示法（notation）。几乎所有计算机编程语言都具有对基本值的字面量表示，诸如：整数、浮点数以及字符串；而有很多也对布尔类型和字符类型的值也支持字面量表示；还有一些甚至对枚举类型的元素以及像数组、记录和对象等复合类型的值也支持字面量表示法。
</p>

<p>
字面量是指由字母，数字等构成的字符串或者数值，它只能作为右值出现。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7fd22e2" class="outline-2">
<h2 id="org7fd22e2"><span class="section-number-2">3</span> 生活备忘</h2>
</div>
